# Groupby Object in pandas

### Key concept of groupby: 
-> Split-Apply-Combine: The core concept behind groupby.
 - Split: Splitting the data into groups based on some criteria.
 - Apply: Applying a function to each group independently.
 - Combine: Combining the results into a data structure.

In [1]:
import pandas as pd
import numpy as np

In [ ]:
data1 = pd.read_csv('StudentsPerformance.csv')

In [ ]:
data1.head()

In [ ]:
data1.value_counts('race/ethnicity')

In [ ]:
data1.info()

In [7]:
data1.rename(columns={'race/ethnicity':'groups'},inplace=True)

In [8]:
groups = data1.groupby('groups') # This creates a groupby object named groups

In [ ]:
print(groups) # Address of the group..

In [ ]:
type(groups)

In [ ]:
for group,data in groups: # This way can be used to print that group data.. because it stores similiar as dictionary.
    print(group)
    print(data)

## Aggregation
-> Common aggregation functions:
 - sum()
 - mean()
 - count()
 - min()
 - max()
 - std() (standard deviation)
 - var() (variance)

-> Custom aggregation using agg() or aggregate()

-> Named aggregation (defining multiple aggregation operations at once)

In [ ]:
# sum()
groups.sum()

In [ ]:
# sum()
groups.sum(numeric_only=True)

In [ ]:
# mean()
groups.mean(numeric_only=True)

In [ ]:
# max()
groups.max(numeric_only=True)

In [ ]:
groups.count()

### Practice:

In [ ]:
# Find that group which scored highest total in math.
groups['math score'].sum().sort_values(ascending=False).head(1)

In [ ]:
# Find that group which scored highest avg in writing.


groups['writing score'].mean().sort_values(ascending=False).head(1)

In [ ]:
# find that parental level of education which has highest total in reading score.
data1.groupby('parental level of education')['reading score'].sum().sort_values(ascending=False).head(1)

In [ ]:
# find the highest math score of each group
groups['math score'].max()

### groupby() attributes and Functions in Pandas:

 - groups
 - ngroups
 - len()
 - size()
 - indices
 - nunique()
 - dtypes
 - count()
 - first()
 - last()
 - head()
 - tail()
 - get_group()
 - describe()
 - apply()

In [ ]:
# groups
data1.groupby('parental level of education').groups

In [ ]:
data1['parental level of education'].iloc[12]

In [ ]:
# ngroups
data1.groupby('gender').ngroups

In [ ]:
# len()
len(data1.groupby('parental level of education'))

In [ ]:
# size()
data1.groupby('groups').size()

In [ ]:
# indices
groups.indices

In [ ]:
# nunique()
groups.nunique()

In [ ]:
# dtypes
groups.dtypes

In [ ]:
data1.head()

In [ ]:
gen=data1.groupby('gender')
for x,y in gen:
    print(x)
    print(y.head())

In [ ]:
# count
groups.count()

In [ ]:
# first() -> Returns the first row of each group.
groups.first()

In [ ]:
# last() -> Returns the last row of each group.
groups.last()

In [ ]:
data1.head(10)

In [ ]:
# head(n) -> Returns the first n rows from each group.
data1.groupby('gender').head(1)

In [ ]:
# tail(n) -> Returns the last n rows from each group.
data1.groupby('parental level of education').tail(2)

In [ ]:
groups.head(2)

In [ ]:
# sample()
groups.sample()

In [ ]:
# describe()
groups.describe()

In [ ]:
male1=gen.get_group('male')
male1.head()

In [ ]:
# get_group()
groups.get_group('group A')

### Custom aggregation

In [ ]:
# agg() -> using dict
groups.agg(
    {
        'math score':'mean',
        'reading score':'max',
        'writing score':'sum',
    }
)

### Named aggregation

In [ ]:
# agg() -> using list (defining multiple aggregation operations at once for all the columns of group)
groups.agg(['min','max','count'])

In [ ]:
# Adding both the syntax
groups.agg(
    {
        'math score':['mean','min'],
        'reading score':'std',
        'writing score':['sum','max','min']
    }
)

### Looping on groups.

In [ ]:
# looping on groups

for group,data in groups:
  print(group,data)

In [ ]:
for group,data in groups:
    if group == 'group A':
        data['test preparation course'] += ' course'
    print(data)

### groupby on multiple cols

In [ ]:
# groupby on multiple cols
two_groups = data1.groupby(['groups','gender'])
two_groups

In [ ]:
two_groups.mean(numeric_only=True)

In [ ]:
two_groups['math score'].sum().sort_values(ascending=False).head(1)

In [ ]:
# agg on multiple groupby
two_groups.agg(['min','max'])

### Excercise

# Merging in pandas.

1. pd.concat()
2. df1.merge(df2)

In [2]:
d1 = pd.read_csv("course_info_1.csv")

In [3]:
d1.head(4)

   course_id course_name
0       1001      python
1       1002         C++
2       1003           C
3       1004        Java

In [4]:
d2 = pd.read_csv("course_info_2.csv")

In [5]:
d2.head(4)

   course_id course_name
0       1015        HTML
1       1016         CSS
2       1017  Javascript
3       1018         PHP

In [6]:
# concat()
ans = pd.concat([d1,d2])
ans

    course_id         course_name
0        1001              python
1        1002                 C++
2        1003                   C
3        1004                Java
4        1005               Flask
5        1006              Django
6        1007                 SQL
7        1008                MERN
8        1009                 AWS
9        1010                 API
10       1011           Reasoning
11       1012                 DSA
12       1013        Data Science
13       1014               NoSql
14       2000            power BI
15       2001             tableau
0        1015                HTML
1        1016                 CSS
2        1017          Javascript
3        1018                 PHP
4        1019             MongoDB
5        1020               MYsql
6        1021             English
7        1022  Applied Mathmatics
8        1023       Deep learning
9        1024               Numpy
10       1025              Pandas
11       1026          Matplotlib
12       1027             Seaborn

In [7]:
# ignore_index
ans1 = pd.concat([d1,d2],keys=['class1','class2'])
ans1

           course_id         course_name
class1 0        1001              python
       1        1002                 C++
       2        1003                   C
       3        1004                Java
       4        1005               Flask
       5        1006              Django
       6        1007                 SQL
       7        1008                MERN
       8        1009                 AWS
       9        1010                 API
       10       1011           Reasoning
       11       1012                 DSA
       12       1013        Data Science
       13       1014               NoSql
       14       2000            power BI
       15       2001             tableau
class2 0        1015                HTML
       1        1016                 CSS
       2        1017          Javascript
       3        1018                 PHP
       4        1019             MongoDB
       5        1020               MYsql
       6        1021             English
       7        1022  Applied Mathmatics
       8        1023       Deep learning
       9        1024               Numpy
       10       1025              Pandas
       11       1026          Matplotlib
       12       1027             Seaborn

### -> merge()
1. left join
2. right join
3. inner join
4. outer join

In [3]:
course_fees = pd.read_csv("course_fees.csv")

In [ ]:
course_fees.head()

In [4]:
course_info_1 = pd.read_csv("course_info_1.csv")

In [ ]:
course_info_1.head()

In [ ]:
# left join
course_info_1.merge(course_fees,how="left",on="course_id")

In [ ]:
# right join
course_info_1.merge(course_fees,how="right",on="course_id")

In [ ]:
# outer join
course_info_1.merge(course_fees,how="outer",on="course_id")

In [ ]:
# inner join
course_info_1.merge(course_fees,how="inner",on="course_id")

In [61]:
# self join

In [ ]:
# Alternate syntax of merging

pd.merge(course_info_1,course_fees,how="inner",on='course_id')